testcases/client/LAC-TC-01-CalcLoanAmt-Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://www.amortizer.org/LoanCalcService/">
   <soapenv:Header/>
   <soapenv:Body>
      <loan:CalcLoanAmt>
         <loanPmt>1250.00</loanPmt>
         <loanTerm>360</loanTerm>
         <loanRate>5.375</loanRate>
      </loan:CalcLoanAmt>
   </soapenv:Body>
</soapenv:Envelope>