testcases/service/LAC-TC-04-CalcLoanTerm-Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://www.amortizer.org/LoanCalcService/">
   <soapenv:Header/>
   <soapenv:Body>
      <loan:CalcLoanTerm>
         <loanAmt>24950</loanAmt>
         <loanRate>7.25</loanRate>
         <loanPmt>699.50</loanPmt>
      </loan:CalcLoanTerm>
   </soapenv:Body>
</soapenv:Envelope>